//#include<iostream>
//using namespace std;
//
//int main()
//{
//	//三目运算符的作用：实现简单的判断
//	//表达式1 ？表达式2 ：表达式3
//	//解释：当表达式1的值为真时，执行表达式2，并返回表达式2的结果；
//		//若表达式1的值为假时，执行表达式3，并则返回表达式3的的结果
//	//在c++中，三目运算符返回的是变量，可以继续赋值
//	int a = 3;
//	int b = 4;
//	int c = 5;
//
//	//对a和b进行比较，将变量小的赋值给c
//	c = a <  b ? a : b;
//	cout << "c=" << c<<endl;//3,a<b为真，执行表达式2，并返回表示式2的结果
//	
//	(a < b ? a : b) = 22;
//	cout << "a=" <<a << endl;//22，这里将22赋值给a，因为返回的结果a是变量
//	cout << "b=" << b << endl;//4,
//	
//
//	cout << "Press Enter to continue..";
//	cin.get();
//
//	return 0;
//}