#include<iostream>
using namespace std;
int main()
{
	//嵌套练习：打印九九乘法表
	/*	1*1=1
		1*2=2   2*2=4
		1*3=3   2*3=6   3*3=9
		1*4=4   2*4=8   3*4=12  4*4=16
		1*5=5   2*5=10  3*5=15  4*5=20  5*5=25
		1*6=6   2*6=12  3*6=18  4*6=24  5*6=30  6*6=36
		1*7=7   2*7=14  3*7=21  4*7=28  5*7=35  6*7=42  7*7=49
		1*8=8   2*8=16  3*8=24  4*8=32  5*8=40  6*8=48  7*8=56  8*8=64
		1*9=9   2*9=18  3*9=27  4*9=36  5*9=45  6*9=54  7*9=63  8*9=72  9*9=81
		
		思维要领：我们可以想到是行数*列数就可以得到计算结果
		那么怎么样实现行列相乘就是我们首先要考虑的；
		此时我们回顾之前的for循环，就可以简单的实现行数和列数
		for (int i = 1; i <=9; i++)
	{
		//行数
	for (int j = 1; j <= 9; j++)
	{
		cout << j ;
	}
	cout << endl;
	}
		但是难点就在于我们怎么实现列数<=当前行数呢？
		这个时候我们将j<=9  ==>   j<=i即可实现
		for (int j = 1; j <= i; j++)
		*/
		

	for (int i = 1; i <=9; i++)
	{
		/*cout << i << endl;*/
		//行数
		for (int j = 1; j <=i; j++)
		{
			cout << j << "*" << i << "=" << i * j << "\t";//“\t是之前学过的制表符”
		}
		cout << endl;
	}
	

	cout << "Press Enter to continue...";
	cin.ignore();
	cin.get();

	return 0;
}